Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_event.c
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 *  Copyright (c) 2011, Oracle and/or its affiliates. All rights reserved.
 */

/*
 * mcxnex_event.c
 *    Mcxnex Interrupt and Event Processing Routines
 *
 *    Implements all the routines necessary for allocating, freeing, and
 *    handling all of the various event types that the Mcxnex hardware can
 *    generate.
 *    These routines include the main Mcxnex interrupt service routine
 *    (mcxnex_isr()) as well as all the code necessary to setup and handle
 *    events from each of the many event queues used by the Mcxnex device.
 */

#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
#include <sys/modctl.h>

#include "mcxnex.h"

static void mcxnex_eq_poll(mcxnex_state_t *state, mcxnex_eqhdl_t eq);
static void mcxnex_eq_catastrophic(mcxnex_state_t *state);
static int mcxnex_eq_alloc(mcxnex_state_t *state, uint32_t log_eq_size,
    uint_t intr, mcxnex_eqhdl_t *eqhdl);
static int mcxnex_eq_free(mcxnex_state_t *state, mcxnex_eqhdl_t *eqhdl);
static int mcxnex_eq_handler_init(mcxnex_state_t *state, mcxnex_eqhdl_t eq,
    uint_t evt_type_mask, int (*eqfunc)(mcxnex_state_t *state,
    mcxnex_eqhdl_t eq, mcxnex_hw_eqe_t *eqe));
static int mcxnex_eq_handler_fini(mcxnex_state_t *state, mcxnex_eqhdl_t eq);
static int mcxnex_port_state_change_handler(mcxnex_state_t *state,
    mcxnex_eqhdl_t eq, mcxnex_hw_eqe_t *eqe);
static int mcxnex_comm_estbl_handler(mcxnex_state_t *state,
    mcxnex_eqhdl_t eq, mcxnex_hw_eqe_t *eqe);
static int mcxnex_local_wq_cat_err_handler(mcxnex_state_t *state,
    mcxnex_eqhdl_t eq, mcxnex_hw_eqe_t *eqe);
static int mcxnex_invreq_local_wq_err_handler(mcxnex_state_t *state,
    mcxnex_eqhdl_t eq, mcxnex_hw_eqe_t *eqe);
static int mcxnex_local_acc_vio_wq_err_handler(mcxnex_state_t *state,
    mcxnex_eqhdl_t eq, mcxnex_hw_eqe_t *eqe);
static int mcxnex_sendq_drained_handler(mcxnex_state_t *state,
    mcxnex_eqhdl_t eq, mcxnex_hw_eqe_t *eqe);
static int mcxnex_path_mig_handler(mcxnex_state_t *state,
    mcxnex_eqhdl_t eq, mcxnex_hw_eqe_t *eqe);
static int mcxnex_path_mig_err_handler(mcxnex_state_t *state,
    mcxnex_eqhdl_t eq, mcxnex_hw_eqe_t *eqe);
static int mcxnex_catastrophic_handler(mcxnex_state_t *state,
    mcxnex_eqhdl_t eq, mcxnex_hw_eqe_t *eqe);
static int mcxnex_srq_last_wqe_reached_handler(mcxnex_state_t *state,
    mcxnex_eqhdl_t eq, mcxnex_hw_eqe_t *eqe);
static int mcxnex_ecc_detection_handler(mcxnex_state_t *state,
    mcxnex_eqhdl_t eq, mcxnex_hw_eqe_t *eqe);
static int mcxnex_no_eqhandler(mcxnex_state_t *state, mcxnex_eqhdl_t eq,
    mcxnex_hw_eqe_t *eqe);
static int mcxnex_eq_demux(mcxnex_state_t *state, mcxnex_eqhdl_t eq,
    mcxnex_hw_eqe_t *eqe);

extern int mcxnex_verbose;

/*
 * mcxnex_eq_init_all
 *    Context: Only called from attach() path context
 */
int
mcxnex_eq_init_all(mcxnex_state_t *state)
{
	uint_t		log_eq_size, intr_num;
	uint_t		num_eq, num_eq_init, num_eq_unmap, num_eq_rsvd;
	uint32_t	event_mask;	/* used for multiple event types */
	int		status, i, num_extra;
	uint64_t	offset;
	ddi_acc_handle_t uarhdl = mcxnex_get_uarhdl(state);

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test);

	/*
	 * For now, all Event Queues default to the same size (pulled from
	 * the current configuration profile) and are all assigned to the
	 * same interrupt or MSI.  In the future we may support assigning
	 * EQs to specific interrupts or MSIs XXX
	 */
	log_eq_size = state->hs_cfg_profile->cp_log_eq_sz;

	/*
	 * Total number of supported EQs is fixed.  Mcxnex hardware
	 * supports up to 512 EQs, though in theory they will one day be
	 * alloc'd to virtual HCA's.  We are currently using only 47 of them
	 * - that is, in Arbel and Tavor, before MCXNEX, where
	 * we had set aside the first 32 for use with Completion Queues (CQ)
	 * and reserved a few of the other 32 for each specific class of event
	 *
	 * However, with the coming of vitualization, we'll have only 4 per
	 * potential guest - so, we'll try alloc'ing them differntly
	 * (see below for more details).
	 */
	num_eq = MCXNEX_NUM_EQ_USED;
	num_eq_rsvd = state->hs_devlim.num_rsvd_eq;

	/*
	 * If MSI is to be used, then set intr_num to the MSI number.
	 * Otherwise, for fixed (i.e. 'legacy') interrupts,
	 * it is what the card tells us in 'inta_pin'.
	 */
	if (state->hs_intr_type_chosen == DDI_INTR_TYPE_FIXED) {
		intr_num = state->hs_adapter.inta_pin;
		num_extra = 0;
	} else {
		/* If we have more than one MSI-X vector, init them. */
		for (i = 0; i + 1 < state->hs_intrmsi_allocd; i++) {
			status = mcxnex_eq_alloc(state, log_eq_size, i,
			    &state->hs_eqhdl[i + num_eq_rsvd]);
			if (status != DDI_SUCCESS) {
				while (--i >= 0) {
					(void) mcxnex_eq_handler_fini(state,
					    state->hs_eqhdl[i + num_eq_rsvd]);
					(void) mcxnex_eq_free(state,
					    &state->hs_eqhdl[i + num_eq_rsvd]);
				}
				return (DDI_FAILURE);
			}

			(void) mcxnex_eq_handler_init(state,
			    state->hs_eqhdl[i + num_eq_rsvd],
			    MCXNEX_EVT_NO_MASK, mcxnex_cq_handler);
		}
		intr_num = i;
		num_extra = i;
	}

	/*
	 * Allocate and initialize the rest of the Event Queues to be used.
	 * If any of these EQ allocations fail then jump to the end, cleanup
	 * what had been successfully initialized, and return an error.
	 */
	for (i = 0; i < num_eq; i++) {
		status = mcxnex_eq_alloc(state, log_eq_size, intr_num,
		    &state->hs_eqhdl[num_eq_rsvd + num_extra + i]);
		if (status != DDI_SUCCESS) {
			num_eq_init = i;
			goto all_eq_init_fail;
		}
	}
	num_eq_init = num_eq;
	/*
	 * The "num_eq_unmap" variable is used in any possible failure
	 * cleanup (below) to indicate which events queues might require
	 * possible event class unmapping.
	 */
	num_eq_unmap = 0;
	/*
	 * Setup EQ0 (first avail) for use with Completion Queues.  Note: We can
	 * cast the return value to void here because, when we use the
	 * MCXNEX_EVT_NO_MASK flag, it is not possible for
	 * mcxnex_eq_handler_init() to return an error.
	 */

	(void) mcxnex_eq_handler_init(state,
	    state->hs_eqhdl[num_eq_unmap + num_extra + num_eq_rsvd],
	    MCXNEX_EVT_NO_MASK, mcxnex_cq_handler);

	num_eq_unmap++;

