Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_event.c
	/*
	 * Setup EQ1 for handling Completion Queue Error Events.
	 *
	 * These events include things like CQ overflow or CQ access
	 * violation errors.  If this setup fails for any reason (which, in
	 * general, it really never should), then jump to the end, cleanup
	 * everything that has been successfully initialized, and return an
	 * error.
	 */
	status = mcxnex_eq_handler_init(state,
	    state->hs_eqhdl[num_eq_unmap + num_extra + num_eq_rsvd],
	    MCXNEX_EVT_MSK_CQ_ERRORS, mcxnex_cq_err_handler);
	if (status != DDI_SUCCESS) {
		goto all_eq_init_fail;
	}
	num_eq_unmap++;


	/*
	 * Setup EQ2 for handling most other things including:
	 *
	 * Port State Change Events
	 *   These events include things like Port Up and Port Down events.
	 *
	 * Communication Established Events
	 *   These events correspond to the IB affiliated asynchronous events
	 *   that are used for connection management
	 *
	 * Path Migration Succeeded Events
	 *   These evens corresponid to the IB affiliated asynchronous events
	 *   that are used to indicate successful completion of a
	 *   Path Migration.
	 *
	 * Command Completion Events
	 *   These events correspond to the Arbel generated events that are used
	 *   to indicate Arbel firmware command completion.
	 *
	 * Local WQ Catastrophic Error Events
	 * Invalid Req Local WQ Error Events
	 * Local Access Violation WQ Error Events
	 * SRQ Catastrophic Error Events
	 * SRQ Last WQE Reached Events
	 * ECC error detection events
	 *   These events also correspond to the similarly-named IB affiliated
	 *   asynchronous error type.
	 *
	 * Send Queue Drained Events
	 *   These events correspond to the IB affiliated asynchronous events
	 *   that are used to indicate completion of a Send Queue Drained QP
	 *   state transition.
	 *
	 * Path Migration Failed Events
	 *   These events correspond to the IB affiliated asynchronous events
	 *   that are used to indicate that path migration was not successful.
	 *
	 * NOTE: When an event fires on this EQ, it will demux the type and
	 * 	send it to the right specific handler routine
	 *
	 */


	event_mask =
	    MCXNEX_EVT_MSK_PORT_STATE_CHANGE |
	    MCXNEX_EVT_MSK_COMM_ESTABLISHED |
	    MCXNEX_EVT_MSK_COMMAND_INTF_COMP |
	    MCXNEX_EVT_MSK_LOCAL_WQ_CAT_ERROR |
	    MCXNEX_EVT_MSK_INV_REQ_LOCAL_WQ_ERROR |
	    MCXNEX_EVT_MSK_LOCAL_ACC_VIO_WQ_ERROR |
	    MCXNEX_EVT_MSK_SEND_QUEUE_DRAINED |
	    MCXNEX_EVT_MSK_PATH_MIGRATED |
	    MCXNEX_EVT_MSK_PATH_MIGRATE_FAILED |
	    MCXNEX_EVT_MSK_SRQ_CATASTROPHIC_ERROR |
	    MCXNEX_EVT_MSK_SRQ_LAST_WQE_REACHED |
	    MCXNEX_EVT_MSK_ECC_DETECTION;

	status = mcxnex_eq_handler_init(state,
	    state->hs_eqhdl[num_eq_unmap + num_extra + num_eq_rsvd],
	    event_mask, mcxnex_eq_demux);
	if (status != DDI_SUCCESS) {
		goto all_eq_init_fail;
	}
	num_eq_unmap++;

	/*
	 * Setup EQ3 to catch all other types of events.  Specifically, we
	 * do not catch the "Local EEC Catastrophic Error Event" because we
	 * should have no EEC (the Arbel driver does not support RD).  We also
	 * choose not to handle any of the address translation page fault
	 * event types.  Since we are not doing any page fault handling (and
	 * since the Arbel firmware does not currently support any such
	 * handling), we allow these events to go to the catch-all handler.
	 */
	status = mcxnex_eq_handler_init(state,
	    state->hs_eqhdl[num_eq_unmap + num_extra + num_eq_rsvd],
	    MCXNEX_EVT_CATCHALL_MASK, mcxnex_no_eqhandler);
	if (status != DDI_SUCCESS) {
		goto all_eq_init_fail;
	}
	num_eq_unmap++;

	/* the FMA retry loop starts. */
	mcxnex_pio_start(state, uarhdl, all_eq_init_fail, fm_loop_cnt,
	    fm_status, fm_test);

	/*
	 * Run through and initialize the Consumer Index for each EQC.
	 */
	for (i = 0; i < num_eq + num_extra; i++) {
		offset = ARM_EQ_INDEX(i + num_eq_rsvd);
		ddi_put32(uarhdl,
		    (uint32_t *)((uintptr_t)state->hs_reg_uar_baseaddr +
		    (uint32_t)offset), 0x0);
	}

	/* the FMA retry loop ends. */
	mcxnex_pio_end(state, uarhdl, all_eq_init_fail, fm_loop_cnt,
	    fm_status, fm_test);

	return (DDI_SUCCESS);

all_eq_init_fail:

	/* Unmap any of the partially mapped EQs from above */
	for (i = 0; i < num_eq_unmap + num_extra; i++) {
		(void) mcxnex_eq_handler_fini(state,
		    state->hs_eqhdl[i + num_eq_rsvd]);
	}

	/* Free up any of the partially allocated EQs from above */
	for (i = 0; i < num_eq_init + num_extra; i++) {
		(void) mcxnex_eq_free(state, &state->hs_eqhdl[i]);
	}

	/* If a HW error happen during ddi_pio, return DDI_FAILURE */
	if (fm_status == HCA_PIO_PERSISTENT) {
		mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_NON_FATAL);
		status = DDI_FAILURE;
	}

	return (status);
}


/*
 * mcxnex_eq_fini_all
 *    Context: Only called from attach() and/or detach() path contexts
 */
int
mcxnex_eq_fini_all(mcxnex_state_t *state)
{
	uint_t		num_eq, num_eq_rsvd;
	int		status, i;

	/*
	 * Grab the total number of supported EQs again.  This is the same
	 * hardcoded value that was used above (during the event queue
	 * initialization.)
	 */
	num_eq = MCXNEX_NUM_EQ_USED + state->hs_intrmsi_allocd - 1;
	num_eq_rsvd = state->hs_devlim.num_rsvd_eq;

	/*
	 * For each of the event queues that we initialized and mapped
	 * earlier, attempt to unmap the events from the EQ.
	 */
	for (i = 0; i < num_eq; i++) {
		status = mcxnex_eq_handler_fini(state,
		    state->hs_eqhdl[i + num_eq_rsvd]);
		if (status != DDI_SUCCESS) {
			return (DDI_FAILURE);
		}
	}

	/*
	 * Teardown and free up all the Event Queues that were allocated
	 * earlier.
	 */
	for (i = 0; i < num_eq; i++) {
		status = mcxnex_eq_free(state,
		    &state->hs_eqhdl[i + num_eq_rsvd]);
		if (status != DDI_SUCCESS) {
			return (DDI_FAILURE);
		}
	}

	return (DDI_SUCCESS);
}

/*
 * mcxnex_eq_arm()
 *	Context:  called from interrupt
 *
 * Arms a single eq - eqn is the __logical__ eq number 0-based
 */
void
mcxnex_eq_arm(mcxnex_state_t *state, int eqn)
{
	uint64_t	offset;
	mcxnex_eqhdl_t	eq;
	uint32_t	eq_ci;
	ddi_acc_handle_t uarhdl = mcxnex_get_uarhdl(state);

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test);

	offset = ARM_EQ_INDEX(eqn + state->hs_devlim.num_rsvd_eq);
	eq = state->hs_eqhdl[eqn + state->hs_devlim.num_rsvd_eq];
	eq_ci = (eq->eq_consindx & MCXNEX_EQ_CI_MASK) | EQ_ARM_BIT;

	/* the FMA retry loop starts. */
	mcxnex_pio_start(state, uarhdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test);

	ddi_put32(uarhdl,
	    (uint32_t *)((uintptr_t)state->hs_reg_uar_baseaddr +
	    (uint32_t)offset), eq_ci);

	/* the FMA retry loop ends. */
	mcxnex_pio_end(state, uarhdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test);

	return;

pio_error:
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_FATAL);
}


