Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_event.c
/*
 * mcxnex_eq_arm_all
 *    Context: Only called from attach() and/or detach() path contexts
 *    Arbel calls in interrupt, currently (initial impl) in Mcxnex as well
 */
int
mcxnex_eq_arm_all(mcxnex_state_t *state)
{
	uint_t		num_eq, num_eq_rsvd;
	uint64_t	offset;
	mcxnex_eqhdl_t	eq;
	uint32_t	eq_ci;
	int		i;
	ddi_acc_handle_t uarhdl = mcxnex_get_uarhdl(state);

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test);

	num_eq = MCXNEX_NUM_EQ_USED;
	num_eq_rsvd = state->hs_devlim.num_rsvd_eq;

	/* the FMA retry loop starts. */
	mcxnex_pio_start(state, uarhdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test);

	for (i = 0; i < num_eq; i++) {
		offset = ARM_EQ_INDEX(i + num_eq_rsvd);
		eq = state->hs_eqhdl[i + num_eq_rsvd];
		eq_ci = (eq->eq_consindx & MCXNEX_EQ_CI_MASK) | EQ_ARM_BIT;
		ddi_put32(uarhdl,
		    (uint32_t *)((uintptr_t)state->hs_reg_uar_baseaddr +
		    (uint32_t)offset), eq_ci);
	}

	/* the FMA retry loop ends. */
	mcxnex_pio_end(state, uarhdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test);

	return (DDI_SUCCESS);

pio_error:
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_NON_FATAL);
	return (DDI_FAILURE);
}


/*
 * mcxnex_isr()
 *    Context: Only called from interrupt context (and during panic)
 */
uint_t
mcxnex_isr(caddr_t arg1, caddr_t arg2)
{
	mcxnex_state_t	*state;
	int		i, r;
	int		intr;

	/*
	 * Grab the Mcxnex softstate pointer from the input parameter
	 */
	state	= (mcxnex_state_t *)(void *)arg1;

	/* Get the interrupt number */
	intr = (int)(uintptr_t)arg2;

	/*
	 * Clear the interrupt.  Note: This is only needed for
	 * fixed interrupts as the framework does what is needed for
	 * MSI-X interrupts.
	 */
	if (state->hs_intr_type_chosen == DDI_INTR_TYPE_FIXED) {
		ddi_acc_handle_t cmdhdl = mcxnex_get_cmdhdl(state);

		/* initialize the FMA retry loop */
		mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test);

		/* the FMA retry loop starts. */
		mcxnex_pio_start(state, cmdhdl, pio_error, fm_loop_cnt,
		    fm_status, fm_test);

		ddi_put64(cmdhdl, state->hs_cmd_regs.clr_intr,
		    (uint64_t)1 << state->hs_adapter.inta_pin);

		/* the FMA retry loop ends. */
		mcxnex_pio_end(state, cmdhdl, pio_error, fm_loop_cnt, fm_status,
		    fm_test);
	}

	/*
	 * Loop through all the EQs looking for ones that have "fired".
	 * To determine if an EQ is fired, the ownership will be the SW
	 * (the HW will set the owner appropriately). Update the Consumer Index
	 * of the Event Queue Entry (EQE) and pass it to HW by writing it
	 * to the respective Set CI DB Register.
	 *
	 * The "else" case handles the extra EQs used only for completion
	 * events, whereas the "if" case deals with the required interrupt
	 * vector that is used for all classes of events.
	 */
	r = state->hs_devlim.num_rsvd_eq;

	if (intr + 1 == state->hs_intrmsi_allocd) {	/* last intr */
		r += state->hs_intrmsi_allocd - 1;
		for (i = 0; i < MCXNEX_NUM_EQ_USED; i++) {
			mcxnex_eq_poll(state, state->hs_eqhdl[i + r]);
		}
	} else {	/* only poll the one EQ */
		mcxnex_eq_poll(state, state->hs_eqhdl[intr + r]);
	}

	return (DDI_INTR_CLAIMED);

pio_error:
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_FATAL);
	return (DDI_INTR_UNCLAIMED);
}


/*
 * mcxnex_eq_poll
 *    Context: Only called from interrupt context (and during panic)
 */
static void
mcxnex_eq_poll(mcxnex_state_t *state, mcxnex_eqhdl_t eq)
{
	mcxnex_hw_eqe_t	*eqe;
	uint64_t	offset;
	uint32_t	cons_indx, wrap_around_mask;
	int (*eqfunction)(mcxnex_state_t *state, mcxnex_eqhdl_t eq,
	    mcxnex_hw_eqe_t *eqe);
	ddi_acc_handle_t uarhdl = mcxnex_get_uarhdl(state);

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test);

	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*eq))

	/* Get the consumer pointer index */
	cons_indx = eq->eq_consindx;

	/*
	 * Calculate the wrap around mask.  Note: This operation only works
	 * because all Mcxnex event queues have power-of-2 sizes
	 */
	wrap_around_mask = (eq->eq_bufsz - 1);

	/* Calculate the pointer to the first EQ entry */
	eqe = &eq->eq_buf[(cons_indx & wrap_around_mask)];


	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*eqe))

	/*
	 * Pull the handler function for this EQ from the Mcxnex Event Queue
	 * handle
	 */
	eqfunction = eq->eq_func;

	while (MCXNEX_EQE_OWNER_IS_SW(eq, eqe)) {

		/*
		 * Call the EQ handler function.  But only call if we
		 * are not in polled I/O mode (i.e. not processing
		 * because of a system panic).  Note: We don't call
		 * the EQ handling functions from a system panic
		 * because we are primarily concerned only with
		 * ensuring that the event queues do not overflow (or,
		 * more specifically, the event queue associated with
		 * the CQ that is being used in the sync/dump process).
		 * Also, we don't want to make any upcalls (to the
		 * IBTF) because we can't guarantee when/if those
		 * calls would ever return.  And, if we're in panic,
		 * then we reached here through a PollCQ() call (from
		 * mcxnex_cq_poll()), and we need to ensure that we
		 * successfully return any work completions to the
		 * caller.
		 */
		if (ddi_in_panic() == 0) {
			eqfunction(state, eq, eqe);
		}

		/* Reset to hardware ownership is implicit */

		eq->eq_nexteqe++;	/* for next time through */

		/* Increment the consumer index */
		cons_indx++;

		/* Update the pointer to the next EQ entry */
		eqe = &eq->eq_buf[(cons_indx & wrap_around_mask)];
	}

	/*
	 * write consumer index via EQ set CI Doorbell, to keep overflow
	 * from occuring during poll
	 */

	eq->eq_consindx = cons_indx;

	offset = ARM_EQ_INDEX(eq->eq_eqnum);

	/* the FMA retry loop starts. */
	mcxnex_pio_start(state, uarhdl, pio_error, fm_loop_cnt,
	    fm_status, fm_test);

	ddi_put32(uarhdl,
	    (uint32_t *)((uintptr_t)state->hs_reg_uar_baseaddr +
	    (uint32_t)offset), (cons_indx & MCXNEX_EQ_CI_MASK) |
	    EQ_ARM_BIT);

	/* the FMA retry loop starts. */
	mcxnex_pio_end(state, uarhdl, pio_error, fm_loop_cnt,
	    fm_status, fm_test);

	return;

pio_error:
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_FATAL);
}


