Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_event.c
	(void) ddi_dma_sync(mr->mr_bindinfo.bi_dmahdl, 0,
	    eq->eq_eqinfo.qa_size, DDI_DMA_SYNC_FORDEV);

	/*
	 * Fill in the EQC entry.  This is the final step before passing
	 * ownership of the EQC entry to the Mcxnex hardware.  We use all of
	 * the information collected/calculated above to fill in the
	 * requisite portions of the EQC.  Note:  We create all EQs in the
	 * "fired" state.  We will arm them later (after our interrupt
	 * routine had been registered.)
	 */
	bzero(&eqc_entry, sizeof (mcxnex_hw_eqc_t));
	eqc_entry.state		= MCXNEX_EQ_ARMED;
	eqc_entry.log_eq_sz	= log_eq_size;
	eqc_entry.intr		= intr;
	eqc_entry.log2_pgsz	= mr->mr_log2_pgsz;
	eqc_entry.pg_offs	= eq->eq_eqinfo.qa_pgoffs >> 5;
	eqc_entry.mtt_base_addrh = (uint32_t)((mr->mr_mttaddr >> 32) & 0xFF);
	eqc_entry.mtt_base_addrl =  mr->mr_mttaddr >> 3;
	eqc_entry.cons_indx	= 0x0;
	eqc_entry.prod_indx	= 0x0;

	/*
	 * Write the EQC entry to hardware.  Lastly, we pass ownership of
	 * the entry to the hardware (using the Mcxnex SW2HW_EQ firmware
	 * command).  Note: in general, this operation shouldn't fail.  But
	 * if it does, we have to undo everything we've done above before
	 * returning error.
	 */
	status = mcxnex_cmn_ownership_cmd_post(state, SW2HW_EQ, &eqc_entry,
	    sizeof (mcxnex_hw_eqc_t), eqc->hr_indx, DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_NOTE, "mcxnex%d: SW2HW_EQ command failed: %08x",
		    state->hs_instance, status);
		if (status == MCXNEX_CMD_INVALID_STATUS) {
			mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_SRV_LOST);
		}
		status = DDI_FAILURE;
		goto eqalloc_fail5;
	}

	/*
	 * Fill in the rest of the Mcxnex Event Queue handle.  Having
	 * successfully transferred ownership of the EQC, we can update the
	 * following fields for use in further operations on the EQ.
	 */
	eq->eq_eqcrsrcp	 = eqc;
	eq->eq_rsrcp	 = rsrc;
	eq->eq_consindx	 = 0;
	eq->eq_eqnum	 = eqc->hr_indx;
	eq->eq_buf	 = buf;
	eq->eq_bufsz	 = (1 << log_eq_size);
	eq->eq_log_eqsz	 = log_eq_size;
	eq->eq_nexteqe	 = 0;
	eq->eq_mrhdl	 = mr;
	*eqhdl		 = eq;

	return (DDI_SUCCESS);

/*
 * The following is cleanup for all possible failure cases in this routine
 */
eqalloc_fail5:
	if (mcxnex_mr_deregister(state, &mr, MCXNEX_MR_DEREG_ALL,
	    DDI_NOSLEEP) != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "failed to deregister EQ memory");
	}
eqalloc_fail4:
	mcxnex_queue_free(&eq->eq_eqinfo);
eqalloc_fail3:
	mcxnex_rsrc_free(state, &rsrc);
eqalloc_fail2:
	mcxnex_rsrc_free(state, &eqc);
eqalloc_fail1:
	mcxnex_pd_refcnt_dec(pd);
eqalloc_fail:
	return (status);
}


/*
 * mcxnex_eq_free()
 *    Context: Only called from attach() and/or detach() path contexts
 */
static int
mcxnex_eq_free(mcxnex_state_t *state, mcxnex_eqhdl_t *eqhdl)
{
	mcxnex_rsrc_t		*eqc, *rsrc;
	mcxnex_hw_eqc_t		eqc_entry;
	mcxnex_pdhdl_t		pd;
	mcxnex_mrhdl_t		mr;
	mcxnex_eqhdl_t		eq;
	uint32_t		eqnum;
	int			status;

	/*
	 * Pull all the necessary information from the Mcxnex Event Queue
	 * handle.  This is necessary here because the resource for the
	 * EQ handle is going to be freed up as part of this operation.
	 */
	eq	= *eqhdl;
	eqc	= eq->eq_eqcrsrcp;
	rsrc	= eq->eq_rsrcp;
	pd	= state->hs_pdhdl_internal;
	mr	= eq->eq_mrhdl;
	eqnum	= eq->eq_eqnum;

	/*
	 * Reclaim EQC entry from hardware (using the Mcxnex HW2SW_EQ
	 * firmware command).  If the ownership transfer fails for any reason,
	 * then it is an indication that something (either in HW or SW) has
	 * gone seriously wrong.
	 */
	status = mcxnex_cmn_ownership_cmd_post(state, HW2SW_EQ, &eqc_entry,
	    sizeof (mcxnex_hw_eqc_t), eqnum, DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		MCXNEX_WARNING(state, "failed to reclaim EQC ownership");
		cmn_err(CE_CONT, "Mcxnex: HW2SW_EQ command failed: %08x\n",
		    status);
		return (DDI_FAILURE);
	}

	/*
	 * Deregister the memory for the Event Queue.  If this fails
	 * for any reason, then it is an indication that something (either
	 * in HW or SW) has gone seriously wrong.  So we print a warning
	 * message and continue.
	 */
	status = mcxnex_mr_deregister(state, &mr, MCXNEX_MR_DEREG_ALL,
	    DDI_NOSLEEP);
	if (status != DDI_SUCCESS) {
		MCXNEX_WARNING(state, "failed to deregister EQ memory");
	}

	/* Free the memory for the EQ */
	mcxnex_queue_free(&eq->eq_eqinfo);

	/* Free the Mcxnex Event Queue handle */
	mcxnex_rsrc_free(state, &rsrc);

	/* Free up the EQC entry resource */
	mcxnex_rsrc_free(state, &eqc);

	/* Decrement the reference count on the protection domain (PD) */
	mcxnex_pd_refcnt_dec(pd);

	/* Set the eqhdl pointer to NULL and return success */
	*eqhdl = NULL;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_eq_handler_init
 *    Context: Only called from attach() path context
 */
static int
mcxnex_eq_handler_init(mcxnex_state_t *state, mcxnex_eqhdl_t eq,
    uint_t evt_type_mask, int (*eq_func)(mcxnex_state_t *state,
    mcxnex_eqhdl_t eq, mcxnex_hw_eqe_t *eqe))
{
	int		status;

	/*
	 * Save away the EQ handler function and the event type mask.  These
	 * will be used later during interrupt and event queue processing.
	 */
	eq->eq_func	   = eq_func;
	eq->eq_evttypemask = evt_type_mask;

	/*
	 * Map the EQ to a specific class of event (or events) depending
	 * on the mask value passed in.  The MCXNEX_EVT_NO_MASK means not
	 * to attempt associating the EQ with any specific class of event.
	 * This is particularly useful when initializing the events queues
	 * used for CQ events.   The mapping is done using the Mcxnex MAP_EQ
	 * firmware command.  Note: This command should not, in general, fail.
	 * If it does, then something (probably HW related) has gone seriously
	 * wrong.
	 */
	if (evt_type_mask != MCXNEX_EVT_NO_MASK) {
		status = mcxnex_map_eq_cmd_post(state,
		    MCXNEX_CMD_MAP_EQ_EVT_MAP, eq->eq_eqnum, evt_type_mask,
		    DDI_NOSLEEP);
		if (status != MCXNEX_CMD_SUCCESS) {
			cmn_err(CE_NOTE, "mcxnex%d: MAP_EQ command failed: "
			    "%08x\n", state->hs_instance, status);
			return (DDI_FAILURE);
		}
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_eq_handler_fini
 *    Context: Only called from attach() and/or detach() path contexts
 */
static int
mcxnex_eq_handler_fini(mcxnex_state_t *state, mcxnex_eqhdl_t eq)
{
	int			status;

