Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_event.c
	/*
	 * Unmap the EQ from the event class to which it had been previously
	 * mapped.  The unmapping is done using the Mcxnex MAP_EQ (in much
	 * the same way that the initial mapping was done).  The difference,
	 * however, is in the MCXNEX_EQ_EVT_UNMAP flag that is passed to the
	 * MAP_EQ firmware command.  The MCXNEX_EVT_NO_MASK (which may have
	 * been passed in at init time) still means that no association has
	 * been made between the EQ and any specific class of event (and,
	 * hence, no unmapping is necessary).  Note: This command should not,
	 * in general, fail.  If it does, then something (probably HW related)
	 * has gone seriously wrong.
	 */
	if (eq->eq_evttypemask != MCXNEX_EVT_NO_MASK) {
		status = mcxnex_map_eq_cmd_post(state,
		    MCXNEX_CMD_MAP_EQ_EVT_UNMAP, eq->eq_eqnum,
		    eq->eq_evttypemask, DDI_NOSLEEP);
		if (status != MCXNEX_CMD_SUCCESS) {
			cmn_err(CE_NOTE, "mcxnex%d: MAP_EQ command failed: "
			    "%08x\n", state->hs_instance, status);
			return (DDI_FAILURE);
		}
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_eq_demux()
 *	Context: Called only from interrupt context
 *	Usage:  to demux the various type reported on one EQ
 */
static int
mcxnex_eq_demux(mcxnex_state_t *state, mcxnex_eqhdl_t eq,
    mcxnex_hw_eqe_t *eqe)
{
	uint_t			eqe_evttype;
	int			status = DDI_FAILURE;

	eqe_evttype = MCXNEX_EQE_EVTTYPE_GET(eq, eqe);

	switch (eqe_evttype) {

	case MCXNEX_EVT_PORT_STATE_CHANGE:
		status = mcxnex_port_state_change_handler(state, eq, eqe);
		break;

	case MCXNEX_EVT_COMM_ESTABLISHED:
		status = mcxnex_comm_estbl_handler(state, eq, eqe);
		break;

	case MCXNEX_EVT_COMMAND_INTF_COMP:
		status = mcxnex_cmd_complete_handler(state, eq, eqe);
		break;

	case MCXNEX_EVT_LOCAL_WQ_CAT_ERROR:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_LOCCAT);
		status = mcxnex_local_wq_cat_err_handler(state, eq, eqe);
		break;

	case MCXNEX_EVT_INV_REQ_LOCAL_WQ_ERROR:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_LOCINV);
		status = mcxnex_invreq_local_wq_err_handler(state, eq, eqe);
		break;

	case MCXNEX_EVT_LOCAL_ACC_VIO_WQ_ERROR:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_LOCACEQ);
		status = mcxnex_local_acc_vio_wq_err_handler(state, eq, eqe);
		break;
	case MCXNEX_EVT_SEND_QUEUE_DRAINED:
		status = mcxnex_sendq_drained_handler(state, eq, eqe);
		break;

	case MCXNEX_EVT_PATH_MIGRATED:
		status = mcxnex_path_mig_handler(state, eq, eqe);
		break;

	case MCXNEX_EVT_PATH_MIGRATE_FAILED:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_PATHMIG);
		status = mcxnex_path_mig_err_handler(state, eq, eqe);
		break;

	case MCXNEX_EVT_SRQ_CATASTROPHIC_ERROR:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_SRQCAT);
		status = mcxnex_catastrophic_handler(state, eq, eqe);
		break;

	case MCXNEX_EVT_SRQ_LAST_WQE_REACHED:
		status = mcxnex_srq_last_wqe_reached_handler(state, eq, eqe);
		break;

	case MCXNEX_EVT_ECC_DETECTION:
		status = mcxnex_ecc_detection_handler(state, eq, eqe);
		break;

	default:
		break;
	}
	return (status);
}

/*
 * mcxnex_port_state_change_handler()
 *    Context: Only called from interrupt context
 */
static int
mcxnex_port_state_change_handler(mcxnex_state_t *state, mcxnex_eqhdl_t eq,
    mcxnex_hw_eqe_t *eqe)
{
	ibc_async_event_t	event;
	ibt_async_code_t	type;
	uint_t			subtype;
	uint8_t			port;
	uint_t			eqe_evttype;
	char			link_msg[24];

	eqe_evttype = MCXNEX_EQE_EVTTYPE_GET(eq, eqe);

	ASSERT(eqe_evttype == MCXNEX_EVT_PORT_STATE_CHANGE ||
	    eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW);

	if (eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW) {
		mcxnex_eq_overflow_handler(state, eq, eqe);
		return (DDI_FAILURE);
	}

	/*
	 * Depending on the type of Port State Change event, pass the
	 * appropriate asynch event to the IBTF.
	 */
	port = (uint8_t)MCXNEX_EQE_PORTNUM_GET(eq, eqe);

	/* Check for valid port number in event */
	if ((port == 0) || (port > state->hs_cfg_profile->cp_num_ports)) {
		MCXNEX_WARNING(state, "Unexpected port number in port state "
		    "change event");
		cmn_err(CE_CONT, "  Port number: %02x\n", port);
		return (DDI_FAILURE);
	}

	subtype = MCXNEX_EQE_EVTSUBTYPE_GET(eq, eqe);
	if (subtype == MCXNEX_PORT_LINK_ACTIVE) {
		event.ev_port 	= port;
		type		= IBT_EVENT_PORT_UP;
		if (mcxnex_verbose) {
			(void) snprintf(link_msg, 23, "port %d up", port);
			ddi_dev_report_fault(state->hs_dip,
			    DDI_SERVICE_RESTORED, DDI_EXTERNAL_FAULT, link_msg);
		}
	} else if (subtype == MCXNEX_PORT_LINK_DOWN) {
		event.ev_port	= port;
		type		= IBT_ERROR_PORT_DOWN;
		if (mcxnex_verbose) {
			(void) snprintf(link_msg, 23, "port %d down", port);
			ddi_dev_report_fault(state->hs_dip, DDI_SERVICE_LOST,
			    DDI_EXTERNAL_FAULT, link_msg);
		}
	} else {
		MCXNEX_WARNING(state, "Unexpected subtype in port state change "
		    "event");
		cmn_err(CE_CONT, "  Event type: %02x, subtype: %02x\n",
		    MCXNEX_EQE_EVTTYPE_GET(eq, eqe), subtype);
		return (DDI_FAILURE);
	}

	/*
	 * Deliver the event to the IBTF.  Note: If "hs_ibtfpriv" is NULL,
	 * then we have either received this event before we finished
	 * attaching to the IBTF or we've received it while we are in the
	 * process of detaching.
	 */
	if (state->hs_ibtfpriv != NULL) {
		MCXNEX_DO_IBTF_ASYNC_CALLB(state, type, &event);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_comm_estbl_handler()
 *    Context: Only called from interrupt context
 */
static int
mcxnex_comm_estbl_handler(mcxnex_state_t *state, mcxnex_eqhdl_t eq,
    mcxnex_hw_eqe_t *eqe)
{
	mcxnex_qphdl_t		qp;
	uint_t			qpnum;
	ibc_async_event_t	event;
	ibt_async_code_t	type;
	uint_t			eqe_evttype;

	eqe_evttype = MCXNEX_EQE_EVTTYPE_GET(eq, eqe);

	ASSERT(eqe_evttype == MCXNEX_EVT_COMM_ESTABLISHED ||
	    eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW);

	if (eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW) {
		mcxnex_eq_overflow_handler(state, eq, eqe);
		return (DDI_FAILURE);
	}

	/* Get the QP handle from QP number in event descriptor */
	qpnum = MCXNEX_EQE_QPNUM_GET(eq, eqe);
	qp = mcxnex_qphdl_from_qpnum(state, qpnum);

	/*
	 * If the QP handle is NULL, this is probably an indication
	 * that the QP has been freed already.  In which case, we
	 * should not deliver this event.
	 *
	 * We also check that the QP number in the handle is the
	 * same as the QP number in the event queue entry.  This
	 * extra check allows us to handle the case where a QP was
	 * freed and then allocated again in the time it took to
	 * handle the event queue processing.  By constantly incrementing
	 * the non-constrained portion of the QP number every time
	 * a new QP is allocated, we mitigate (somewhat) the chance
	 * that a stale event could be passed to the client's QP
	 * handler.
	 *
	 * Lastly, we check if "hs_ibtfpriv" is NULL.  If it is then it
	 * means that we've have either received this event before we
	 * finished attaching to the IBTF or we've received it while we
	 * are in the process of detaching.
	 */
	if ((qp != NULL) && (qp->qp_qpnum == qpnum) &&
	    (state->hs_ibtfpriv != NULL)) {
		event.ev_qp_hdl = (ibtl_qp_hdl_t)qp->qp_hdlrarg;
		type		= IBT_EVENT_COM_EST_QP;

