Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_event.c
		MCXNEX_DO_IBTF_ASYNC_CALLB(state, type, &event);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_local_wq_cat_err_handler()
 *    Context: Only called from interrupt context
 */
static int
mcxnex_local_wq_cat_err_handler(mcxnex_state_t *state, mcxnex_eqhdl_t eq,
    mcxnex_hw_eqe_t *eqe)
{
	mcxnex_qphdl_t		qp;
	uint_t			qpnum;
	ibc_async_event_t	event;
	ibt_async_code_t	type;
	uint_t			eqe_evttype;

	eqe_evttype = MCXNEX_EQE_EVTTYPE_GET(eq, eqe);

	ASSERT(eqe_evttype == MCXNEX_EVT_LOCAL_WQ_CAT_ERROR ||
	    eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW);

	if (eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW) {
		mcxnex_eq_overflow_handler(state, eq, eqe);
		return (DDI_FAILURE);
	}

	/* Get the QP handle from QP number in event descriptor */
	qpnum = MCXNEX_EQE_QPNUM_GET(eq, eqe);
	qp = mcxnex_qphdl_from_qpnum(state, qpnum);

	/*
	 * If the QP handle is NULL, this is probably an indication
	 * that the QP has been freed already.  In which case, we
	 * should not deliver this event.
	 *
	 * We also check that the QP number in the handle is the
	 * same as the QP number in the event queue entry.  This
	 * extra check allows us to handle the case where a QP was
	 * freed and then allocated again in the time it took to
	 * handle the event queue processing.  By constantly incrementing
	 * the non-constrained portion of the QP number every time
	 * a new QP is allocated, we mitigate (somewhat) the chance
	 * that a stale event could be passed to the client's QP
	 * handler.
	 *
	 * Lastly, we check if "hs_ibtfpriv" is NULL.  If it is then it
	 * means that we've have either received this event before we
	 * finished attaching to the IBTF or we've received it while we
	 * are in the process of detaching.
	 */
	if ((qp != NULL) && (qp->qp_qpnum == qpnum) &&
	    (state->hs_ibtfpriv != NULL)) {
		event.ev_qp_hdl = (ibtl_qp_hdl_t)qp->qp_hdlrarg;
		type		= IBT_ERROR_CATASTROPHIC_QP;

		MCXNEX_DO_IBTF_ASYNC_CALLB(state, type, &event);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_invreq_local_wq_err_handler()
 *    Context: Only called from interrupt context
 */
static int
mcxnex_invreq_local_wq_err_handler(mcxnex_state_t *state, mcxnex_eqhdl_t eq,
    mcxnex_hw_eqe_t *eqe)
{
	mcxnex_qphdl_t		qp;
	uint_t			qpnum;
	ibc_async_event_t	event;
	ibt_async_code_t	type;
	uint_t			eqe_evttype;

	eqe_evttype = MCXNEX_EQE_EVTTYPE_GET(eq, eqe);

	ASSERT(eqe_evttype == MCXNEX_EVT_INV_REQ_LOCAL_WQ_ERROR ||
	    eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW);

	if (eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW) {
		mcxnex_eq_overflow_handler(state, eq, eqe);
		return (DDI_FAILURE);
	}

	/* Get the QP handle from QP number in event descriptor */
	qpnum = MCXNEX_EQE_QPNUM_GET(eq, eqe);
	qp = mcxnex_qphdl_from_qpnum(state, qpnum);

	/*
	 * If the QP handle is NULL, this is probably an indication
	 * that the QP has been freed already.  In which case, we
	 * should not deliver this event.
	 *
	 * We also check that the QP number in the handle is the
	 * same as the QP number in the event queue entry.  This
	 * extra check allows us to handle the case where a QP was
	 * freed and then allocated again in the time it took to
	 * handle the event queue processing.  By constantly incrementing
	 * the non-constrained portion of the QP number every time
	 * a new QP is allocated, we mitigate (somewhat) the chance
	 * that a stale event could be passed to the client's QP
	 * handler.
	 *
	 * Lastly, we check if "hs_ibtfpriv" is NULL.  If it is then it
	 * means that we've have either received this event before we
	 * finished attaching to the IBTF or we've received it while we
	 * are in the process of detaching.
	 */
	if ((qp != NULL) && (qp->qp_qpnum == qpnum) &&
	    (state->hs_ibtfpriv != NULL)) {
		event.ev_qp_hdl = (ibtl_qp_hdl_t)qp->qp_hdlrarg;
		type		= IBT_ERROR_INVALID_REQUEST_QP;

		MCXNEX_DO_IBTF_ASYNC_CALLB(state, type, &event);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_local_acc_vio_wq_err_handler()
 *    Context: Only called from interrupt context
 */
static int
mcxnex_local_acc_vio_wq_err_handler(mcxnex_state_t *state, mcxnex_eqhdl_t eq,
    mcxnex_hw_eqe_t *eqe)
{
	mcxnex_qphdl_t		qp;
	uint_t			qpnum;
	ibc_async_event_t	event;
	ibt_async_code_t	type;
	uint_t			eqe_evttype;

	eqe_evttype = MCXNEX_EQE_EVTTYPE_GET(eq, eqe);

	ASSERT(eqe_evttype == MCXNEX_EVT_LOCAL_ACC_VIO_WQ_ERROR ||
	    eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW);

	if (eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW) {
		mcxnex_eq_overflow_handler(state, eq, eqe);
		return (DDI_FAILURE);
	}

	/* Get the QP handle from QP number in event descriptor */
	qpnum = MCXNEX_EQE_QPNUM_GET(eq, eqe);
	qp = mcxnex_qphdl_from_qpnum(state, qpnum);

	/*
	 * If the QP handle is NULL, this is probably an indication
	 * that the QP has been freed already.  In which case, we
	 * should not deliver this event.
	 *
	 * We also check that the QP number in the handle is the
	 * same as the QP number in the event queue entry.  This
	 * extra check allows us to handle the case where a QP was
	 * freed and then allocated again in the time it took to
	 * handle the event queue processing.  By constantly incrementing
	 * the non-constrained portion of the QP number every time
	 * a new QP is allocated, we mitigate (somewhat) the chance
	 * that a stale event could be passed to the client's QP
	 * handler.
	 *
	 * Lastly, we check if "hs_ibtfpriv" is NULL.  If it is then it
	 * means that we've have either received this event before we
	 * finished attaching to the IBTF or we've received it while we
	 * are in the process of detaching.
	 */
	if ((qp != NULL) && (qp->qp_qpnum == qpnum) &&
	    (state->hs_ibtfpriv != NULL)) {
		event.ev_qp_hdl = (ibtl_qp_hdl_t)qp->qp_hdlrarg;
		type		= IBT_ERROR_ACCESS_VIOLATION_QP;

		MCXNEX_DO_IBTF_ASYNC_CALLB(state, type, &event);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_sendq_drained_handler()
 *    Context: Only called from interrupt context
 */
static int
mcxnex_sendq_drained_handler(mcxnex_state_t *state, mcxnex_eqhdl_t eq,
    mcxnex_hw_eqe_t *eqe)
{
	mcxnex_qphdl_t		qp;
	uint_t			qpnum;
	ibc_async_event_t	event;
	uint_t			forward_sqd_event;
	ibt_async_code_t	type;
	uint_t			eqe_evttype;

	eqe_evttype = MCXNEX_EQE_EVTTYPE_GET(eq, eqe);

	ASSERT(eqe_evttype == MCXNEX_EVT_SEND_QUEUE_DRAINED ||
	    eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW);

	if (eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW) {
		mcxnex_eq_overflow_handler(state, eq, eqe);
		return (DDI_FAILURE);
	}

	/* Get the QP handle from QP number in event descriptor */
	qpnum = MCXNEX_EQE_QPNUM_GET(eq, eqe);
	qp = mcxnex_qphdl_from_qpnum(state, qpnum);

